In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [1]:
import duckdb
import os
import pandas as pd
import duckdb
import sys

In this notebook the entities for the exploitation database are created.

In [5]:
#con = duckdb.connect(database='/content/drive/MyDrive/ADSDB/TrustedZone/trusted_database.db')
con = duckdb.connect(database='trusted_database.db')
result = con.execute('SHOW TABLES')
tables = result.fetchall()

In [6]:
table_name = 'income'

query = f'SELECT * FROM {table_name};'
df_income = pd.read_sql_query(query, con)

table_name = 'rents'

query = f'SELECT * FROM {table_name};'
df_rents = pd.read_sql_query(query, con)
con.close()

c:\users\sayye\appdata\local\programs\python\python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
df_rents = pd.read_csv('df_rent_avg_month.csv')
df_income = pd.read_csv('df_income_avg.csv')

In [8]:
df_rents.head()

,Year,Trimester,District,Neighbourhood,Price
0,2018,1,ciutat vella,el raval,792.74
1,2018,1,ciutat vella,el gotic,998.40
2,2018,1,ciutat vella,la barceloneta,870.84
3,2018,1,ciutat vella,"sant pere, santa caterina i la ribera",923.44
4,2018,1,eixample,el fort pienc,910.53

In [9]:
df_rents['District'].value_counts()

nou barris             121
horta-guinardo         120
sant marti             120
sants-montjuic          85
sant andreu             74
eixample                72
sarria-sant gervasi     72
gracia                  60
ciutat vella            48
les corts               36
Name: District, dtype: int64

After the homogenization of the same features took place, we are integrating the tables in order to create entity tables for the exploitation database. In order to do this, we create many dataframes with primary and foreign keys, so they can be inserted directly to the tables. The structure idea is explained in the report document.

FIRST create a dataframe that contains all the unique combinations of neighbourhoods and districts.

In [10]:
# delete possible duplicates in rent neighbourhoods
rents_neigh = df_rents.drop_duplicates(
  subset = ['District', 'Neighbourhood'],
  keep = 'last').reset_index(drop = True)
print(len(rents_neigh))
rents_neigh = rents_neigh[['District', 'Neighbourhood']]
rents_neigh.head()

71

       District             Neighbourhood
0    nou barris                torre baro
1   sant andreu             baro de viver
2    sant marti  sant martiide provencals
3  ciutat vella                  el raval
4  ciutat vella                  el gotic

In [11]:
# delete possible duplicates in income neighbourhoods
income_neigh = df_income.drop_duplicates(
  subset = ['Nom_Districte', 'Nom_Barri'],
  keep = 'last').reset_index(drop = True)
print(len(income_neigh))
income_neigh = income_neigh[['Nom_Districte', 'Nom_Barri']]
income_neigh.rename(columns={'Nom_Districte': 'District', 'Nom_Barri': 'Neighbourhood'}, inplace=True)
income_neigh.head()

79

              District            Neighbourhood
0               gracia           vila de gracia
1           sant marti  camp de l'arpa del clot
2       sants-montjuic            sants - badal
3  sarria-sant gervasi        el putget i farro
4  sarria-sant gervasi   sant gervasi - galvany

Merge the dataframes with the distinct area combinations of the two tables into one.

In [12]:
df_merge_col = pd.merge(income_neigh , rents_neigh, on=['Neighbourhood', 'District'], how='outer', indicator=True)
df_merge_col.head()

              District            Neighbourhood     _merge
0               gracia           vila de gracia  left_only
1           sant marti  camp de l'arpa del clot  left_only
2       sants-montjuic            sants - badal       both
3  sarria-sant gervasi        el putget i farro  left_only
4  sarria-sant gervasi   sant gervasi - galvany       both

In [13]:
len(df_merge_col)  # 80 different area combinations

80

In [14]:
df_area = df_merge_col[['District', 'Neighbourhood']]
df_area.head()

              District            Neighbourhood
0               gracia           vila de gracia
1           sant marti  camp de l'arpa del clot
2       sants-montjuic            sants - badal
3  sarria-sant gervasi        el putget i farro
4  sarria-sant gervasi   sant gervasi - galvany

Create the database file, so we can create new tables. Initially, create 'area' table and insert the dataframe created above.

In [15]:
path = 'exploitationDB.db'
con = duckdb.connect(database=path)

In [16]:
table_name = 'area'

query = f'CREATE TABLE {table_name} (district VARCHAR, neighbourhood VARCHAR);'
con.execute(query)
con.execute(f"INSERT INTO {table_name} SELECT District, Neighbourhood FROM df_area")

In [17]:
# Create an ID column for primary key
alter_query = f'ALTER TABLE {table_name} ADD id INTEGER;'
con.execute(alter_query)
update_query = f'UPDATE {table_name} SET id = rowid +1;'
con.execute(update_query)

In [18]:
# print the table created with its first five rows.
result = con.execute('SHOW TABLES')
tables = result.fetchall()

# Iterate through the tables and select the first five rows
for table in tables:
    table_name = table[0]
    print(f"Table: {table_name}")

    # Select the first five rows
    select_first_query = f'SELECT * FROM {table_name} LIMIT 5'
    result = con.execute(select_first_query)
    first_rows = result.fetchall()

    for row in first_rows:
        print(row)

    print("\n")

Table: area
('gracia', 'vila de gracia', 1)
('sant marti', "camp de l'arpa del clot", 2)
('sants-montjuic', 'sants - badal', 3)
('sarria-sant gervasi', 'el putget i farro', 4)
('sarria-sant gervasi', 'sant gervasi - galvany', 5)

Create the 'time' table with only 3 distinct values, (2018, 2019, 2020)

In [19]:
table_name = 'trimester'

query = f'CREATE TABLE {table_name} (id INTEGER, trimester INTEGER, year INTEGER,);'
con.execute(query)
query = f'INSERT INTO {table_name} VALUES (1, 1, 2018), (2, 2, 2018), (3, 3, 2018), (4, 4, 2018), (5, 1, 2019), (6, 2, 2019), (7, 3, 2019), (8, 4, 2019), (9, 1, 2020), (10, 2, 2020), (11, 3, 2020), (12, 4, 2020);'
con.execute(query)

In [20]:
table_name = 'year'

query = f'CREATE TABLE {table_name} (id INTEGER, year INTEGER);'
con.execute(query)
query = f'INSERT INTO {table_name} VALUES (1,2018),(2, 2019), (3,2020);'
con.execute(query)

In [21]:
# store the table in a dataframe.
table_name = 'area'

query = f"SELECT * FROM {table_name}"

# Execute the SQL query
result = con.execute(query)

# Convert the result to a Pandas DataFrame
table_areas = pd.DataFrame(result.fetchall(), columns=result.description)
print(len(table_areas))
table_areas.head()

80

,"(district, STRING, None, None, None, None, None)","(neighbourhood, STRING, None, None, None, None, None)","(id, NUMBER, None, None, None, None, None)"
0,gracia,vila de gracia,1
1,sant marti,camp de l'arpa del clot,2
2,sants-montjuic,sants - badal,3
3,sarria-sant gervasi,el putget i farro,4
4,sarria-sant gervasi,sant gervasi - galvany,5

In [22]:
table_areas.columns = ['District', 'Neighbourhood', 'ID']
table_areas.head()

              District            Neighbourhood  ID
0               gracia           vila de gracia   1
1           sant marti  camp de l'arpa del clot   2
2       sants-montjuic            sants - badal   3
3  sarria-sant gervasi        el putget i farro   4
4  sarria-sant gervasi   sant gervasi - galvany   5

In [23]:
# convert time table in a dataframe as well
table_name = 'trimester'

query = f"SELECT * FROM {table_name}"

# Execute the SQL query
result = con.execute(query)

# Convert the result to a Pandas DataFrame
table_trim = pd.DataFrame(result.fetchall(), columns=result.description)
print(len(table_trim))
table_trim.head()

12

,"(id, NUMBER, None, None, None, None, None)","(trimester, NUMBER, None, None, None, None, None)","(year, NUMBER, None, None, None, None, None)"
0,1,1,2018
1,2,2,2018
2,3,3,2018
3,4,4,2018
4,5,1,2019

In [24]:
table_trim.columns = ['ID', 'Trimester', 'Year']
table_trim.head()

   ID  Trimester  Year
0   1          1  2018
1   2          2  2018
2   3          3  2018
3   4          4  2018
4   5          1  2019

In [25]:
# convert time table in a dataframe as well
table_name = 'year'

query = f"SELECT * FROM {table_name}"

# Execute the SQL query
result = con.execute(query)

# Convert the result to a Pandas DataFrame
table_year = pd.DataFrame(result.fetchall(), columns=result.description)
print(len(table_year))
table_year.head()

3

,"(id, NUMBER, None, None, None, None, None)","(year, NUMBER, None, None, None, None, None)"
0,1,2018
1,2,2019
2,3,2020

In [26]:
table_year.columns = ['ID','Year']
table_year.head()

   ID  Year
0   1  2018
1   2  2019
2   3  2020

These two tables were converted to dataframes so they can be merged with other dataframes which can use 'area' and 'time' primary keys as foreign keys. Here, we merge the 'area' table to the rents table on 'District' and 'Neighbourhood', so rents can have the "AreaID".

In [27]:
result_df = pd.merge(df_rents, table_areas[['District',	'Neighbourhood','ID']], on=['District',	'Neighbourhood'], how='left')

In [28]:
result_df.rename(columns={'ID': 'AreaID'}, inplace=True)

In [29]:
result_df.head()

,Year,Trimester,District,Neighbourhood,Price,AreaID
0,2018,1,ciutat vella,el raval,792.74,8
1,2018,1,ciutat vella,el gotic,998.40,7
2,2018,1,ciutat vella,la barceloneta,870.84,9
3,2018,1,ciutat vella,"sant pere, santa caterina i la ribera",923.44,10
4,2018,1,eixample,el fort pienc,910.53,11

Do a smilar merge for 'time' table and 'rents' table to store the 'YearID' as well. At the end create a table that only has rent, areaID and yearID

In [30]:
result_df = pd.merge(result_df, table_trim[['Year','Trimester','ID']], on=['Year','Trimester'], how='left')

In [31]:
result_df.rename(columns={'ID': 'TrimesterID'}, inplace=True)

In [32]:
area_table = result_df[['Price', 'AreaID', 'TrimesterID']]
area_table.rename(columns={'Price': 'Avg_Rent'}, inplace=True)
area_table.head()

<ipython-input-32-6496437fa23c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  area_table.rename(columns={'Price': 'Avg_Rent'}, inplace=True)

   Avg_Rent  AreaID  TrimesterID
0    792.74       8            1
1    998.40       7            1
2    870.84       9            1
3    923.44      10            1
4    910.53      11            1

The dataframe with rent, areaId and yearID is passed as a table in the exploitation database with the name 'rents'. Add a column for the primary key as well.

In [33]:
table_name = 'rent'

query = f'CREATE TABLE {table_name} (avg_rent DECIMAL, AreaID INTEGER, TrimesterID INTEGER);'
con.execute(query)
con.execute(f"INSERT INTO {table_name} SELECT Avg_Rent, AreaID, TrimesterID FROM area_table")

In [34]:
alter_query = f'ALTER TABLE {table_name} ADD id INTEGER;'
con.execute(alter_query)
update_query = f'UPDATE {table_name} SET id = rowid +1;'
con.execute(update_query)

Something similar needs to be done for a new income table in the exploitation database. Again merge, 'area' and 'time' table in the income dataframe we have from before. Then only keep a dataframe, with 'Seccio_Censal', 'Income', 'AreaID' and 'YearID'.

In [35]:
df_income.head()

,Any,Nom_Districte,Nom_Barri,Import_Renda_Bruta_
0,2018,ciutat vella,el gotic,15882.444444
1,2018,ciutat vella,el raval,11238.095238
2,2018,ciutat vella,la barceloneta,14431.090909
3,2018,ciutat vella,"sant pere, santa caterina i la ribera",16840.307692
4,2018,eixample,el fort pienc,21270.550000

In [36]:
df_income.rename(columns={'Nom_Districte': 'District', 'Nom_Barri': 'Neighbourhood'}, inplace=True)

In [37]:
result_df = pd.merge(df_income, table_areas[['District','Neighbourhood','ID']], on=['District',	'Neighbourhood'], how='left')
result_df.rename(columns={'ID': 'AreaID'}, inplace=True)
result_df.head()

,Any,District,Neighbourhood,Import_Renda_Bruta_,AreaID
0,2018,ciutat vella,el gotic,15882.444444,7
1,2018,ciutat vella,el raval,11238.095238,8
2,2018,ciutat vella,la barceloneta,14431.090909,9
3,2018,ciutat vella,"sant pere, santa caterina i la ribera",16840.307692,10
4,2018,eixample,el fort pienc,21270.550000,11

In [38]:
result_df.rename(columns={'Any': 'Year'}, inplace=True)

In [39]:
result_df2 = pd.merge(result_df, table_year[['Year','ID']], on=['Year'], how='left')
result_df2.rename(columns={'ID': 'YearID'}, inplace=True)
result_df2.head()

,Year,District,Neighbourhood,Import_Renda_Bruta_,AreaID,YearID
0,2018,ciutat vella,el gotic,15882.444444,7,1
1,2018,ciutat vella,el raval,11238.095238,8,1
2,2018,ciutat vella,la barceloneta,14431.090909,9,1
3,2018,ciutat vella,"sant pere, santa caterina i la ribera",16840.307692,10,1
4,2018,eixample,el fort pienc,21270.550000,11,1

In [40]:
income_table = result_df2[['Import_Renda_Bruta_', 'AreaID', 'YearID']]
income_table.rename(columns={'Import_Renda_Bruta_': 'Income'}, inplace=True)
income_table.head()

<ipython-input-40-349b0c538585>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  income_table.rename(columns={'Import_Renda_Bruta_': 'Income'}, inplace=True)

         Income  AreaID  YearID
0  15882.444444       7       1
1  11238.095238       8       1
2  14431.090909       9       1
3  16840.307692      10       1
4  21270.550000      11       1

Now that we kept a dataframe with the imporant columns, create an 'income' table in the exploitation databse and insert the values of this dataframe.

In [41]:
table_name = 'income'

query = f'CREATE TABLE {table_name} (Income DECIMAL, AreaID INTEGER, YearID INTEGER);'
con.execute(query)
con.execute(f"INSERT INTO {table_name} SELECT Income, AreaID, YearID FROM income_table")

In [42]:
# Add one more column for the primaryID
alter_query = f'ALTER TABLE {table_name} ADD id INTEGER;'
con.execute(alter_query)
update_query = f'UPDATE {table_name} SET id = rowid +1;'
con.execute(update_query)

We have created 4 entity tables. Let's print them (first 5 rows) to see our results!

In [43]:
result = con.execute('SHOW TABLES')
tables = result.fetchall()

# Iterate through the tables and select the first and last five rows from each table
for table in tables:
    table_name = table[0]
    print(f"Table: {table_name}")

    # Select the first five rows
    select_first_query = f'SELECT * FROM {table_name} LIMIT 5'
    result = con.execute(select_first_query)
    first_rows = result.fetchall()

    for row in first_rows:
        print(row)

    print("\n")

Table: area
('gracia', 'vila de gracia', 1)
('sant marti', "camp de l'arpa del clot", 2)
('sants-montjuic', 'sants - badal', 3)
('sarria-sant gervasi', 'el putget i farro', 4)
('sarria-sant gervasi', 'sant gervasi - galvany', 5)


Table: income
(Decimal('15882.444'), 7, 1, 1)
(Decimal('11238.095'), 8, 1, 2)
(Decimal('14431.091'), 9, 1, 3)
(Decimal('16840.308'), 10, 1, 4)
(Decimal('21270.550'), 11, 1, 5)


Table: rent
(Decimal('792.740'), 8, 1, 1)
(Decimal('998.400'), 7, 1, 2)
(Decimal('870.840'), 9, 1, 3)
(Decimal('923.440'), 10, 1, 4)
(Decimal('910.530'), 11, 1, 5)


Table: trimester
(1, 1, 2018)
(2, 2, 2018)
(3, 3, 2018)
(4, 4, 2018)
(5, 1, 2019)


Table: year
(1, 2018)
(2, 2019)
(3, 2020)

In [50]:
con.close()

Print also the data types of each table

In [44]:
print('Areas table:')
table_areas.dtypes

Areas table:

District         object
Neighbourhood    object
ID                int64
dtype: object

In [45]:
print('Trimester table:')
table_trim.dtypes

Trimester table:

ID           int64
Trimester    int64
Year         int64
dtype: object

In [46]:
print('Rent table:')
area_table.dtypes

Rent table:

Avg_Rent       float64
AreaID           int64
TrimesterID      int64
dtype: object

In [47]:
print('Income table:')
income_table.dtypes

Income table:

Income    float64
AreaID      int64
YearID      int64
dtype: object

In [48]:
print('Year table:')
table_year.dtypes

Year table:

ID      int64
Year    int64
dtype: object